; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	spectrograph3 - mode
	image4 - mode
	infrared0 - mode
	thermograph5 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation9 - direction
	Star2 - direction
	GroundStation6 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph5)
	(supports instrument0 image4)
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Planet11 image4)
	(have_image Planet11 thermograph5)
	(have_image Star12 thermograph5)
	(have_image Planet13 infrared0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 image4)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 planet14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet14)
   goals met: 0 of 6
4. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 1 of 6
5. (turn_to satellite0 planet13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet13)
   goals met: 1 of 6
6. (take_image satellite0 planet13 instrument0 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 2 of 6
7. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
8. (take_image satellite0 planet11 instrument0 image4)
   added: (have_image planet11 image4)
   goals met: 3 of 6
9. (take_image satellite0 planet11 instrument0 thermograph5)
   added: (have_image planet11 thermograph5)
   goals met: 4 of 6
10. (turn_to satellite0 planet15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet15)
   goals met: 4 of 6
11. (take_image satellite0 planet15 instrument0 image4)
   added: (have_image planet15 image4)
   goals met: 5 of 6
12. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 5 of 6
13. (take_image satellite0 star12 instrument0 thermograph5)
   added: (have_image star12 thermograph5)
   goals met: 6 of 6
